app/controllers/friend_num_controller.rb

SELECT "friend_nums".* FROM "friend_nums" WHERE (num = 3000)
SELECT 1 AS one FROM "friend_nums" WHERE "friend_nums"."num" = ? LIMIT ?  [["num", 3000], ["LIMIT", 1]]
INSERT INTO "friend_nums" ("num", "str_out", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["num", 3000], ["str_out", " 220 and 284; 1184 and 1210; 2620 and 2924"], ["created_at", "2021-12-03 10:53:10.299396"], ["updated_at", "2021-12-03 10:53:10.299396"]]
---
    def result
      @num = params[:num].to_i
      if !FriendNum.exists?(num: num)
        str = check.join(';')
        fr_num = FriendNum.new(num: num, str_out: str)
        fr_num.save

SELECT "friend_nums".* FROM "friend_nums"
---
    def database
      @db = FriendNum.all